# Вправа 1: Проста математика
print("\n=== ВПРАВА 1: Калькулятор ===")
print("Створіть простий калькулятор для двох чисел і двох дій")
print("Підтримувані операції: +, -")

# Початок реалізації:
num1 = float(input("Введіть перше число: "))
operation = input("Введіть операцію (+, -, ): ")
num2 = float(input("Введіть друге число: "))
if operation == '+':
    print(num1 + num2)
elif operation == '-':
    2 print(num1 - num2)

# Вправа 2: Перевірка паролю
print("\n=== ВПРАВА 2: Перевірка паролю ===")
print("Створіть систему перевірки паролю")
print("Пароль повинен містити принаймні 8 символів")

password = input("Введіть пароль, мінімальна довжина 8 символів: ")
if len(password) >= 8:
    print("Ok")
else: 
    print("Incorrect password")


# Вправа 3: Визначення високосного року
print("\n=== ВПРАВА 3: Високосний рік ===")
print("Рік є високосним, якщо:")
print("- Ділиться на 4 І не ділиться на 100")
print("- АБО ділиться на 400")

year = int(input('Ведіть рік: '))
if year % 4 == 0 and year % 100 != 0:
    print('True')
elif year % 400 == 0:
    print('True')
else:
    print('False')


# Вправа 4: Лічильник голосних
print("\n=== ВПРАВА 4: Лічильник голосних ===")
print("Підрахуйте кількість голосних у рядку")

text = input("Введіть текст: ").lower()
vowels = "аеиіїоуюя"
count = 0


# код тут
text_t = tuple(text)
vowels_t = tuple(vowels)
count = 0
for v in vowels_t:
    count += text_t.count(v)
print(f"Кількість голосних: {count}")


# Вправа 5: Гра 
print("\n=== ВПРАВА 5: Гра ===")
"""
Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо колір прибульця green, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця yellow, надрукуйте, що гравець щойно заробив 10 балів.
Якщо колір прибульця red - надрукуйте, що гравець щойно заробив 15 балів.
Перевірте роботу гри самостійно, змінюючи значення alien_color
"""
alien_color = 'red'
if alien_color == 'green':
    print('Вітаю! Ви заробили 5 балів!')
elif alien_color == 'yellow':
    print('Вітаю! Ви заробили 10 балів!')
elif alien_color == 'red':
    print('Вітаю! Ви заробили 15 балів!')


# Вправа 6: Піцерія *
print("\n=== ВПРАВА 6: Начинки для піци (pizza_topping) ===")
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
choise = []
while True:
    pizza_topping = input("Введіть бажані начинки для піцци або quit для виходу: ")
    if pizza_topping == "quit":
        break
    choise.append(pizza_topping)
print(f"Ви вибрали: ", choise, "\nНачинки будуть додані у піццу")



# Вправа 7: Зворотний порядок цифр
print("\n=== ВПРАВА 7: Зворотний порядок ===")
print("Виведіть цифри числа у зворотному порядку")

num = input("Введіть число: ")
print(list(num[::-1]))


# Вправа 8: Пошук максимального числа
print("\n=== ВПРАВА 8: Пошук максимального ===")
print("Знайдіть найбільше число серед введених")
print("Введіть 0 для завершення")

numbers = []
while True:
    numb = input ("Введіть число: ")
    if numb == "0":
        break
    numbers.append(int(numb))
print(f"Ви вибрали: ", numbers, "\nМаксимальне число: ", max(numbers))

# Вправа 9: Виключення зі списку
print("\n=== ВПРАВА 9: Виключення зі списку ===")
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]
for i in fruits:
    if i == "orange":
        continue
    print(i)


# Вправа 10: Вираз в один рядок
print("\n=== ВПРАВА 10: Вираз з умовою в один рядок ===")
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [x **2 for x in numbers if x % 2 == 0]
print(result)  #  [4, 16, 36, 64, 100]