"""
Домашнє завдання: Основи Python

**1.** Створіть три змінні з правильними іменами (англійською мовою): 
одну для збереження віку, 
одну для імені студента, 
одну для позначення чи є особа студентом. 
Додайте коментарі до кожної змінної.
"""
age = 20
name = 'Alex'
it_student = True
"""

**2.** Рзкоментуйте та виправте помилки в наступних назвах змінних.
Поясніть у коментарях, чому початкові назви неправильні:
"""
# 2name = "John"
name_2 = 'John'
# Змінна не може починатися з цифри

# user-age = 25
user_age = 25
# Декілька слів у змінній пишуться через нижне підкреслювання

# $price = 100
price = 100
# Змінна не може містити спецсимволи

# class = "Math"
ed_class = 'Math'
# Змінна не може називатися зарезервованими словами
"""
**3.** Створіть змінну з описовим ім'ям для збереження максимальної кількості студентів у групі. 
Присвойте їй значення 30.
"""
MAX_STUDENTS = 30


"""
**4.** Створіть змінні для збереження: 
назви курсу, 
кількості годин, 
вартості курсу. 
Використайте правильне іменування змінних.
"""
course_name = 'Programming Python'
course_hours = 50
course_cost = 12800

"""
**5.** Розрхуйте та виведіть Затрати курсу: 
Затрати курсу  = кількість годин / вартість курсу
Використайте правильне іменування змінних.
"""
course_expenses = course_cost / course_hours
# У завданні помилка. Правильна формула обчислення затрат
# Затрати курсу = вартість курсу / кулькість годин
print(f'Затрати курсу: {course_expenses} гривень за одну годину.')

"""
**6.** Створіть змінні з різними способами запису чисел:
- Десяткове число: 42
- Двійкове число: 101010 (в двійковій системі)
- Шістнадцяткове число: 2A (в шістнадцятковій системі)
- Восьмеричне число: 52 (в восьмеричній системі)
"""
decimal = 42
binar = 0b101010
heximal = 0x2A
octal = 0o52

print("Diff ", decimal, octal, heximal, binar)

"""
**7.** Виконайте всі арифметичні операції (+, -, *, /, //, %, **) з числами 17 та 5. 
Виведіть результати з поясненнями.
"""
a = 17; b = 5
print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a // b)
print(a % b)
print(a ** b)


"""
**8.** Обчисліть площу кола з радіусом 7.5. Використайте значення π = 3.14159.
"""
circle_radius = 7.5
PI = 3.14159
area_circle = PI * (circle_radius ** 2)
print(f'Площа круга дорівнюе {area_circle}')


"""
**9.** Обчисліть залишок від ділення будь-якого числа на 7. 
Виведіть результат з числами 50, 33, 14.
"""
print(7 % 7)
print('Залишки від ділення:', 50 % 7, 33 % 7, 14 % 7)
# Число 7 взяте за значення умови як будь-яке число

"""
**10.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Площа Чорного моря становить 436 402 км2, а площа Азовського
моря становить 37 800 км2. Яку площу займають Чорне та Азов-
ське моря разом?
"""
black_sea_area = 43_64_02
azov_sea_area = 37_800
total_area = black_sea_area + azov_sea_area
print(f'Загальна площа обох морів становить {total_area} кілометрів квадратних')


"""
**11.** Створіть рядок з вашим повним ім'ям та виведіть:
- Перший символ
- Останній символ  
- Довжину рядка
"""
name = 'Oleksandr'
print(name[0])
print(name[-1])
print(len(name))


"""
**12.** Створіть рядок "Would you tell me, please, which way I ought to go from here?" 
та отримайте з нього підстрічки:
- Перші 6 символів
- Останні 11 символів
"""

text = "Would you tell me, please, which way I ought to go from here?"
print(text [0:6])
print(text [-11:])


"""
**13.** Створіть багаторядковий рядок (використовуючи потрійні лапки) зі своїм улюбленим віршем або цитатою.
"""
'''
My cat is practicing kung fu,
He jumped and kicked my left-side shoe.
He thinks he is a ninja star,
But he just fell into a jar!
'''
# Вірш взятий наобум на просторах інтернету)

"""
**14.** Поєднайте два рядки "Hello" та "World" у різні способи (з пробілом, з комою, з новим рядком).
"""
hello = 'Hello'
world = 'World'
print(f'{hello} {world}')
print(hello + ' ' + world)
print(hello, world)
print(hello + '\n' + world)



"""
**15.** Створіть рядок з символами, які потребують екранування (лапки, зворотна коса риска).
"""
print('Цей текст містить лапки \', подвійні лапки \" і навіть зворотній слеш \\')
"""
**16.** Напишіть код, який запитує у користувача його ім'я та вік, 
а потім виводить привітання у форматі: "Привіт, [ім'я]! Тобі [вік] років."
"""
query_string = 'Як тебе звуть? '
name_user = input(query_string)
query_string = 'Скільки тобі років? '
age_user = input(query_string)
print(f'Привіт {name_user}! Ти вже такий дорослий тобі вже аж {age_user} років!!!')
"""

**17.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Ігор займається фотографією. Він вирішив зібрати всі свої 232
фотографії та вклеїти в альбом. На одній сторінці може бути
розміщено щонайбільше 8 фото. Скільки сторінок знадобиться
Ігорю, щоб вклеїти всі фото?
"""
photo_count = 232
one_page = 8
total_page = photo_count // one_page
if photo_count % one_page != 0:
    total_page = total_page + 1
print(total_page)

"""
**18.** Напишіть код який запитує у користувача 
його улюблений колір та число, а потім створює персоналізоване
повідомлення використовуючи f-string форматування.
"""
query_string = 'Розкажи мені який твій улюблений колір? '
color = input(query_string)
query_string = 'А найулюбленіше число? '
like_number = input(query_string)
print(f'Твій улюблений колір - {color} а улюблене число - {like_number}.  Я все вірно записав?')



"""
**19.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Мережа супермаркетів має 3 склади, де всього розміщено
375 291 товар. На першому та другому складах перебуває
250 449 товарів. На другому та третьому – 222 950 товарів.
Знайдіть кількість товарів, що розміщені на кожному складі.
"""
storage_total = 375_291
total_storage_1_2 = 250_449
total_storage_2_3 = 222_950
storage_1 = storage_total - total_storage_2_3
storage_3 = storage_total - total_storage_1_2
storage_2 = storage_total - (storage_1 + storage_3)
if storage_total == storage_1 + storage_2 + storage_3:
    print(f'На першому складі знаходиться {storage_1} товарів, на другому - {storage_2} товарів і відповідно на третьому {storage_3} товарів.')
else:
    print('Щось пішло не так. Спробуйте ще раз!')

"""
**20.** Переведіть задачу з книги "Математика, 5 клас"
на мову пітон і виведіть відповідь, так, щоб було
зрозуміло дитині, що навчається в п'ятому класі:
Михайло разом з батьками вирішили купити комп’ютер, ско-
риставшись послугою «Оплата частинами». Відомо, що сплачу-
вати необхідно буде півтора року по 1179 грн/місяць. Обчисліть
вартість комп’ютера.
"""
year = 12 #months
total_months = int(year * 1.5)
monthly_cost = 1179
pc_cost = total_months * monthly_cost
print(f'Взагалом вартість комп\'ютера вийде {pc_cost} гривень за весь період виплат.')
